SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_gpio.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 GPIO register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_GPIO_H
#define EFR32SG23_GPIO_H

#define GPIO_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/

#include "efr32sg23_gpio_port.h"


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< ACMP0 pin enable                                   */
  __IOM uint32_t             ACMPOUTROUTE;           /**< ACMPOUT port/pin select                            */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_ACMPROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< CMU pin enable                                     */
  __IOM uint32_t             CLKIN0ROUTE;            /**< CLKIN0 port/pin select                             */
  __IOM uint32_t             CLKOUT0ROUTE;           /**< CLKOUT0 port/pin select                            */
  __IOM uint32_t             CLKOUT1ROUTE;           /**< CLKOUT1 port/pin select                            */
  __IOM uint32_t             CLKOUT2ROUTE;           /**< CLKOUT2 port/pin select                            */
        uint32_t             RESERVED0[2U];          /**< Reserved for future use                            */
} GPIO_CMUROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< EUSART0 pin enable                                 */
  __IOM uint32_t             CSROUTE;                /**< CS port/pin select                                 */
  __IOM uint32_t             CTSROUTE;               /**< CTS port/pin select                                */
  __IOM uint32_t             RTSROUTE;               /**< RTS port/pin select                                */
  __IOM uint32_t             RXROUTE;                /**< RX port/pin select                                 */
  __IOM uint32_t             SCLKROUTE;              /**< SCLK port/pin select                               */
  __IOM uint32_t             TXROUTE;                /**< TX port/pin select                                 */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_EUSARTROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< FRC pin enable                                     */
  __IOM uint32_t             DCLKROUTE;              /**< DCLK port/pin select                               */
  __IOM uint32_t             DFRAMEROUTE;            /**< DFRAME port/pin select                             */
  __IOM uint32_t             DOUTROUTE;              /**< DOUT port/pin select                               */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_FRCROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< I2C0 pin enable                                    */
  __IOM uint32_t             SCLROUTE;               /**< SCL port/pin select                                */
  __IOM uint32_t             SDAROUTE;               /**< SDA port/pin select                                */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_I2CROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< KEYSCAN pin enable                                 */
  __IOM uint32_t             COLOUT0ROUTE;           /**< COLOUT0 port/pin select                            */
  __IOM uint32_t             COLOUT1ROUTE;           /**< COLOUT1 port/pin select                            */
  __IOM uint32_t             COLOUT2ROUTE;           /**< COLOUT2 port/pin select                            */
  __IOM uint32_t             COLOUT3ROUTE;           /**< COLOUT3 port/pin select                            */
  __IOM uint32_t             COLOUT4ROUTE;           /**< COLOUT4 port/pin select                            */
  __IOM uint32_t             COLOUT5ROUTE;           /**< COLOUT5 port/pin select                            */
  __IOM uint32_t             COLOUT6ROUTE;           /**< COLOUT6 port/pin select                            */
  __IOM uint32_t             COLOUT7ROUTE;           /**< COLOUT7 port/pin select                            */
  __IOM uint32_t             ROWSENSE0ROUTE;         /**< ROWSENSE0 port/pin select                          */
  __IOM uint32_t             ROWSENSE1ROUTE;         /**< ROWSENSE1 port/pin select                          */
  __IOM uint32_t             ROWSENSE2ROUTE;         /**< ROWSENSE2 port/pin select                          */
  __IOM uint32_t             ROWSENSE3ROUTE;         /**< ROWSENSE3 port/pin select                          */
  __IOM uint32_t             ROWSENSE4ROUTE;         /**< ROWSENSE4 port/pin select                          */
  __IOM uint32_t             ROWSENSE5ROUTE;         /**< ROWSENSE5 port/pin select                          */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_KEYSCANROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< LESENSE pin enable                                 */
  __IOM uint32_t             CH0OUTROUTE;            /**< CH0OUT port/pin select                             */
  __IOM uint32_t             CH1OUTROUTE;            /**< CH1OUT port/pin select                             */
  __IOM uint32_t             CH2OUTROUTE;            /**< CH2OUT port/pin select                             */
  __IOM uint32_t             CH3OUTROUTE;            /**< CH3OUT port/pin select                             */
  __IOM uint32_t             CH4OUTROUTE;            /**< CH4OUT port/pin select                             */
  __IOM uint32_t             CH5OUTROUTE;            /**< CH5OUT port/pin select                             */
  __IOM uint32_t             CH6OUTROUTE;            /**< CH6OUT port/pin select                             */
  __IOM uint32_t             CH7OUTROUTE;            /**< CH7OUT port/pin select                             */
  __IOM uint32_t             CH8OUTROUTE;            /**< CH8OUT port/pin select                             */
  __IOM uint32_t             CH9OUTROUTE;            /**< CH9OUT port/pin select                             */
  __IOM uint32_t             CH10OUTROUTE;           /**< CH10OUT port/pin select                            */
  __IOM uint32_t             CH11OUTROUTE;           /**< CH11OUT port/pin select                            */
  __IOM uint32_t             CH12OUTROUTE;           /**< CH12OUT port/pin select                            */
  __IOM uint32_t             CH13OUTROUTE;           /**< CH13OUT port/pin select                            */
  __IOM uint32_t             CH14OUTROUTE;           /**< CH14OUT port/pin select                            */
  __IOM uint32_t             CH15OUTROUTE;           /**< CH15OUT port/pin select                            */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_LESENSEROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< LETIMER pin enable                                 */
  __IOM uint32_t             OUT0ROUTE;              /**< OUT0 port/pin select                               */
  __IOM uint32_t             OUT1ROUTE;              /**< OUT1 port/pin select                               */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_LETIMERROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< MODEM pin enable                                   */
  __IOM uint32_t             ANT0ROUTE;              /**< ANT0 port/pin select                               */
  __IOM uint32_t             ANT1ROUTE;              /**< ANT1 port/pin select                               */
  __IOM uint32_t             ANTROLLOVERROUTE;       /**< ANTROLLOVER port/pin select                        */
  __IOM uint32_t             ANTRR0ROUTE;            /**< ANTRR0 port/pin select                             */
  __IOM uint32_t             ANTRR1ROUTE;            /**< ANTRR1 port/pin select                             */
  __IOM uint32_t             ANTRR2ROUTE;            /**< ANTRR2 port/pin select                             */
  __IOM uint32_t             ANTRR3ROUTE;            /**< ANTRR3 port/pin select                             */
  __IOM uint32_t             ANTRR4ROUTE;            /**< ANTRR4 port/pin select                             */
  __IOM uint32_t             ANTRR5ROUTE;            /**< ANTRR5 port/pin select                             */
  __IOM uint32_t             ANTSWENROUTE;           /**< ANTSWEN port/pin select                            */
  __IOM uint32_t             ANTSWUSROUTE;           /**< ANTSWUS port/pin select                            */
  __IOM uint32_t             ANTTRIGROUTE;           /**< ANTTRIG port/pin select                            */
  __IOM uint32_t             ANTTRIGSTOPROUTE;       /**< ANTTRIGSTOP port/pin select                        */
  __IOM uint32_t             DCLKROUTE;              /**< DCLK port/pin select                               */
  __IOM uint32_t             DINROUTE;               /**< DIN port/pin select                                */
  __IOM uint32_t             DOUTROUTE;              /**< DOUT port/pin select                               */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_MODEMROUTE_TypeDef;


typedef struct
{
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             S0INROUTE;              /**< S0IN port/pin select                               */
  __IOM uint32_t             S1INROUTE;              /**< S1IN port/pin select                               */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
} GPIO_PCNTROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< PRS0 pin enable                                    */
  __IOM uint32_t             ASYNCH0ROUTE;           /**< ASYNCH0 port/pin select                            */
  __IOM uint32_t             ASYNCH1ROUTE;           /**< ASYNCH1 port/pin select                            */
  __IOM uint32_t             ASYNCH2ROUTE;           /**< ASYNCH2 port/pin select                            */
  __IOM uint32_t             ASYNCH3ROUTE;           /**< ASYNCH3 port/pin select                            */
  __IOM uint32_t             ASYNCH4ROUTE;           /**< ASYNCH4 port/pin select                            */
  __IOM uint32_t             ASYNCH5ROUTE;           /**< ASYNCH5 port/pin select                            */
  __IOM uint32_t             ASYNCH6ROUTE;           /**< ASYNCH6 port/pin select                            */
  __IOM uint32_t             ASYNCH7ROUTE;           /**< ASYNCH7 port/pin select                            */
  __IOM uint32_t             ASYNCH8ROUTE;           /**< ASYNCH8 port/pin select                            */
  __IOM uint32_t             ASYNCH9ROUTE;           /**< ASYNCH9 port/pin select                            */
  __IOM uint32_t             ASYNCH10ROUTE;          /**< ASYNCH10 port/pin select                           */
  __IOM uint32_t             ASYNCH11ROUTE;          /**< ASYNCH11 port/pin select                           */
  __IOM uint32_t             SYNCH0ROUTE;            /**< SYNCH0 port/pin select                             */
  __IOM uint32_t             SYNCH1ROUTE;            /**< SYNCH1 port/pin select                             */
  __IOM uint32_t             SYNCH2ROUTE;            /**< SYNCH2 port/pin select                             */
  __IOM uint32_t             SYNCH3ROUTE;            /**< SYNCH3 port/pin select                             */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_PRSROUTE_TypeDef;


typedef struct
{
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             BUFOUTREQINASYNCROUTE;  /**< BUFOUTREQINASYNC port/pin select                   */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
} GPIO_SYXOROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< TIMER0 pin enable                                  */
  __IOM uint32_t             CC0ROUTE;               /**< CC0 port/pin select                                */
  __IOM uint32_t             CC1ROUTE;               /**< CC1 port/pin select                                */
  __IOM uint32_t             CC2ROUTE;               /**< CC2 port/pin select                                */
  __IOM uint32_t             CDTI0ROUTE;             /**< CDTI0 port/pin select                              */
  __IOM uint32_t             CDTI1ROUTE;             /**< CDTI1 port/pin select                              */
  __IOM uint32_t             CDTI2ROUTE;             /**< CDTI2 port/pin select                              */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_TIMERROUTE_TypeDef;


typedef struct
{
  __IOM uint32_t             ROUTEEN;                /**< USART0 pin enable                                  */
  __IOM uint32_t             CSROUTE;                /**< CS port/pin select                                 */
  __IOM uint32_t             CTSROUTE;               /**< CTS port/pin select                                */
  __IOM uint32_t             RTSROUTE;               /**< RTS port/pin select                                */
  __IOM uint32_t             RXROUTE;                /**< RX port/pin select                                 */
  __IOM uint32_t             CLKROUTE;               /**< SCLK port/pin select                               */
  __IOM uint32_t             TXROUTE;                /**< TX port/pin select                                 */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
} GPIO_USARTROUTE_TypeDef;

