SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_gpio.h
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< main                                               */
        uint32_t             RESERVED0[11U];         /**< Reserved for future use                            */
        GPIO_PORT_TypeDef    P[4U];                  /**<                                                    */
        uint32_t             RESERVED1[132U];        /**< Reserved for future use                            */
  __IOM uint32_t             LOCK;                   /**< Lock Register                                      */
        uint32_t             RESERVED2[3U];          /**< Reserved for future use                            */
  __IM  uint32_t             GPIOLOCKSTATUS;         /**< Lock Status                                        */
        uint32_t             RESERVED3[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             ABUSALLOC;              /**< A Bus allocation                                   */
  __IOM uint32_t             BBUSALLOC;              /**< B Bus allocation                                   */
  __IOM uint32_t             CDBUSALLOC;             /**< CD Bus allocation                                  */
        uint32_t             RESERVED4[53U];         /**< Reserved for future use                            */
  __IOM uint32_t             EXTIPSELL;              /**< External Interrupt Port Select Low                 */
  __IOM uint32_t             EXTIPSELH;              /**< External interrupt Port Select High                */
  __IOM uint32_t             EXTIPINSELL;            /**< External Interrupt Pin Select Low                  */
  __IOM uint32_t             EXTIPINSELH;            /**< External Interrupt Pin Select High                 */
  __IOM uint32_t             EXTIRISE;               /**< External Interrupt Rising Edge Trigger             */
  __IOM uint32_t             EXTIFALL;               /**< External Interrupt Falling Edge Trigger            */
        uint32_t             RESERVED5[2U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF;                     /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable                                   */
        uint32_t             RESERVED6[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             EM4WUEN;                /**< EM4 wakeup enable                                  */
  __IOM uint32_t             EM4WUPOL;               /**< EM4 wakeup polarity                                */
        uint32_t             RESERVED7[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             DBGROUTEPEN;            /**< Debugger Route Pin enable                          */
  __IOM uint32_t             TRACEROUTEPEN;          /**< Trace Route Pin Enable                             */
        uint32_t             RESERVED8[2U];          /**< Reserved for future use                            */
        uint32_t             RESERVED9[4U];          /**< Reserved for future use                            */
  __IOM uint32_t             LCDSEG;                 /**< LCD Segment Enable                                 */
        uint32_t             RESERVED10[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCOM;                 /**< LCD Common Enable                                  */
        uint32_t             RESERVED11[3U];         /**< Reserved for future use                            */
        GPIO_ACMPROUTE_TypeDef ACMPROUTE[2U];          /**< acmp0 DBUS config registers                        */
        GPIO_CMUROUTE_TypeDef CMUROUTE;               /**< cmu DBUS config registers                          */
        uint32_t             RESERVED12[4U];         /**< Reserved for future use                            */
        GPIO_EUSARTROUTE_TypeDef EUSARTROUTE[3U];        /**< eusart0 DBUS config registers                      */
        GPIO_FRCROUTE_TypeDef FRCROUTE;               /**< frc DBUS config registers                          */
        GPIO_I2CROUTE_TypeDef I2CROUTE[2U];           /**< i2c0 DBUS config registers                         */
        GPIO_KEYSCANROUTE_TypeDef KEYSCANROUTE;           /**< keyscan DBUS config registers                      */
        GPIO_LESENSEROUTE_TypeDef LESENSEROUTE;           /**< lesense DBUS config registers                      */
        GPIO_LETIMERROUTE_TypeDef LETIMERROUTE;           /**< letimer DBUS config registers                      */
        GPIO_MODEMROUTE_TypeDef MODEMROUTE;             /**< modem DBUS config registers                        */
        GPIO_PCNTROUTE_TypeDef PCNTROUTE[1U];          /**< pcnt0 DBUS config registers                        */
        GPIO_PRSROUTE_TypeDef PRSROUTE[1U];           /**< prs0 DBUS config registers                         */
        uint32_t             RESERVED13[23U];        /**< Reserved for future use                            */
        GPIO_SYXOROUTE_TypeDef SYXOROUTE[1U];          /**< syxo0 DBUS config registers                        */
        GPIO_TIMERROUTE_TypeDef TIMERROUTE[5U];         /**< timer0 DBUS config registers                       */
        GPIO_USARTROUTE_TypeDef USARTROUTE[1U];         /**< usart0 DBUS config registers                       */
        uint32_t             RESERVED14[530U];       /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< main                                               */
        uint32_t             RESERVED15[11U];        /**< Reserved for future use                            */
        GPIO_PORT_TypeDef    P_SET[4U];              /**<                                                    */
        uint32_t             RESERVED16[132U];       /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_SET;               /**< Lock Register                                      */
        uint32_t             RESERVED17[3U];         /**< Reserved for future use                            */
  __IM  uint32_t             GPIOLOCKSTATUS_SET;     /**< Lock Status                                        */
        uint32_t             RESERVED18[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             ABUSALLOC_SET;          /**< A Bus allocation                                   */
  __IOM uint32_t             BBUSALLOC_SET;          /**< B Bus allocation                                   */
  __IOM uint32_t             CDBUSALLOC_SET;         /**< CD Bus allocation                                  */
        uint32_t             RESERVED19[53U];        /**< Reserved for future use                            */
  __IOM uint32_t             EXTIPSELL_SET;          /**< External Interrupt Port Select Low                 */
  __IOM uint32_t             EXTIPSELH_SET;          /**< External interrupt Port Select High                */
  __IOM uint32_t             EXTIPINSELL_SET;        /**< External Interrupt Pin Select Low                  */
  __IOM uint32_t             EXTIPINSELH_SET;        /**< External Interrupt Pin Select High                 */
  __IOM uint32_t             EXTIRISE_SET;           /**< External Interrupt Rising Edge Trigger             */
  __IOM uint32_t             EXTIFALL_SET;           /**< External Interrupt Falling Edge Trigger            */
        uint32_t             RESERVED20[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable                                   */
        uint32_t             RESERVED21[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM4WUEN_SET;            /**< EM4 wakeup enable                                  */
  __IOM uint32_t             EM4WUPOL_SET;           /**< EM4 wakeup polarity                                */
        uint32_t             RESERVED22[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             DBGROUTEPEN_SET;        /**< Debugger Route Pin enable                          */
  __IOM uint32_t             TRACEROUTEPEN_SET;      /**< Trace Route Pin Enable                             */
        uint32_t             RESERVED23[2U];         /**< Reserved for future use                            */
        uint32_t             RESERVED24[4U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDSEG_SET;             /**< LCD Segment Enable                                 */
        uint32_t             RESERVED25[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCOM_SET;             /**< LCD Common Enable                                  */
        uint32_t             RESERVED26[3U];         /**< Reserved for future use                            */
        GPIO_ACMPROUTE_TypeDef ACMPROUTE_SET[2U];      /**< acmp0 DBUS config registers                        */
        GPIO_CMUROUTE_TypeDef CMUROUTE_SET;           /**< cmu DBUS config registers                          */
        uint32_t             RESERVED27[4U];         /**< Reserved for future use                            */
        GPIO_EUSARTROUTE_TypeDef EUSARTROUTE_SET[3U];    /**< eusart0 DBUS config registers                      */
        GPIO_FRCROUTE_TypeDef FRCROUTE_SET;           /**< frc DBUS config registers                          */
        GPIO_I2CROUTE_TypeDef I2CROUTE_SET[2U];       /**< i2c0 DBUS config registers                         */
        GPIO_KEYSCANROUTE_TypeDef KEYSCANROUTE_SET;       /**< keyscan DBUS config registers                      */
        GPIO_LESENSEROUTE_TypeDef LESENSEROUTE_SET;       /**< lesense DBUS config registers                      */
        GPIO_LETIMERROUTE_TypeDef LETIMERROUTE_SET;       /**< letimer DBUS config registers                      */
        GPIO_MODEMROUTE_TypeDef MODEMROUTE_SET;         /**< modem DBUS config registers                        */
        GPIO_PCNTROUTE_TypeDef PCNTROUTE_SET[1U];      /**< pcnt0 DBUS config registers                        */
        GPIO_PRSROUTE_TypeDef PRSROUTE_SET[1U];       /**< prs0 DBUS config registers                         */
        uint32_t             RESERVED28[23U];        /**< Reserved for future use                            */
        GPIO_SYXOROUTE_TypeDef SYXOROUTE_SET[1U];      /**< syxo0 DBUS config registers                        */
        GPIO_TIMERROUTE_TypeDef TIMERROUTE_SET[5U];     /**< timer0 DBUS config registers                       */
        GPIO_USARTROUTE_TypeDef USARTROUTE_SET[1U];     /**< usart0 DBUS config registers                       */
        uint32_t             RESERVED29[530U];       /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< main                                               */
        uint32_t             RESERVED30[11U];        /**< Reserved for future use                            */
        GPIO_PORT_TypeDef    P_CLR[4U];              /**<                                                    */
        uint32_t             RESERVED31[132U];       /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_CLR;               /**< Lock Register                                      */
        uint32_t             RESERVED32[3U];         /**< Reserved for future use                            */
  __IM  uint32_t             GPIOLOCKSTATUS_CLR;     /**< Lock Status                                        */
        uint32_t             RESERVED33[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             ABUSALLOC_CLR;          /**< A Bus allocation                                   */
  __IOM uint32_t             BBUSALLOC_CLR;          /**< B Bus allocation                                   */
  __IOM uint32_t             CDBUSALLOC_CLR;         /**< CD Bus allocation                                  */
        uint32_t             RESERVED34[53U];        /**< Reserved for future use                            */
  __IOM uint32_t             EXTIPSELL_CLR;          /**< External Interrupt Port Select Low                 */
  __IOM uint32_t             EXTIPSELH_CLR;          /**< External interrupt Port Select High                */
  __IOM uint32_t             EXTIPINSELL_CLR;        /**< External Interrupt Pin Select Low                  */
  __IOM uint32_t             EXTIPINSELH_CLR;        /**< External Interrupt Pin Select High                 */
  __IOM uint32_t             EXTIRISE_CLR;           /**< External Interrupt Rising Edge Trigger             */
  __IOM uint32_t             EXTIFALL_CLR;           /**< External Interrupt Falling Edge Trigger            */
        uint32_t             RESERVED35[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable                                   */
        uint32_t             RESERVED36[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM4WUEN_CLR;            /**< EM4 wakeup enable                                  */
  __IOM uint32_t             EM4WUPOL_CLR;           /**< EM4 wakeup polarity                                */
        uint32_t             RESERVED37[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             DBGROUTEPEN_CLR;        /**< Debugger Route Pin enable                          */
  __IOM uint32_t             TRACEROUTEPEN_CLR;      /**< Trace Route Pin Enable                             */
        uint32_t             RESERVED38[2U];         /**< Reserved for future use                            */
        uint32_t             RESERVED39[4U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDSEG_CLR;             /**< LCD Segment Enable                                 */
        uint32_t             RESERVED40[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCOM_CLR;             /**< LCD Common Enable                                  */
        uint32_t             RESERVED41[3U];         /**< Reserved for future use                            */
        GPIO_ACMPROUTE_TypeDef ACMPROUTE_CLR[2U];      /**< acmp0 DBUS config registers                        */
        GPIO_CMUROUTE_TypeDef CMUROUTE_CLR;           /**< cmu DBUS config registers                          */
        uint32_t             RESERVED42[4U];         /**< Reserved for future use                            */
        GPIO_EUSARTROUTE_TypeDef EUSARTROUTE_CLR[3U];    /**< eusart0 DBUS config registers                      */
        GPIO_FRCROUTE_TypeDef FRCROUTE_CLR;           /**< frc DBUS config registers                          */
        GPIO_I2CROUTE_TypeDef I2CROUTE_CLR[2U];       /**< i2c0 DBUS config registers                         */
        GPIO_KEYSCANROUTE_TypeDef KEYSCANROUTE_CLR;       /**< keyscan DBUS config registers                      */
        GPIO_LESENSEROUTE_TypeDef LESENSEROUTE_CLR;       /**< lesense DBUS config registers                      */
        GPIO_LETIMERROUTE_TypeDef LETIMERROUTE_CLR;       /**< letimer DBUS config registers                      */
        GPIO_MODEMROUTE_TypeDef MODEMROUTE_CLR;         /**< modem DBUS config registers                        */
        GPIO_PCNTROUTE_TypeDef PCNTROUTE_CLR[1U];      /**< pcnt0 DBUS config registers                        */
        GPIO_PRSROUTE_TypeDef PRSROUTE_CLR[1U];       /**< prs0 DBUS config registers                         */
        uint32_t             RESERVED43[23U];        /**< Reserved for future use                            */
        GPIO_SYXOROUTE_TypeDef SYXOROUTE_CLR[1U];      /**< syxo0 DBUS config registers                        */
        GPIO_TIMERROUTE_TypeDef TIMERROUTE_CLR[5U];     /**< timer0 DBUS config registers                       */
        GPIO_USARTROUTE_TypeDef USARTROUTE_CLR[1U];     /**< usart0 DBUS config registers                       */
        uint32_t             RESERVED44[530U];       /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< main                                               */
        uint32_t             RESERVED45[11U];        /**< Reserved for future use                            */
        GPIO_PORT_TypeDef    P_TGL[4U];              /**<                                                    */
        uint32_t             RESERVED46[132U];       /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_TGL;               /**< Lock Register                                      */
        uint32_t             RESERVED47[3U];         /**< Reserved for future use                            */
  __IM  uint32_t             GPIOLOCKSTATUS_TGL;     /**< Lock Status                                        */
        uint32_t             RESERVED48[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             ABUSALLOC_TGL;          /**< A Bus allocation                                   */
  __IOM uint32_t             BBUSALLOC_TGL;          /**< B Bus allocation                                   */
  __IOM uint32_t             CDBUSALLOC_TGL;         /**< CD Bus allocation                                  */
        uint32_t             RESERVED49[53U];        /**< Reserved for future use                            */
  __IOM uint32_t             EXTIPSELL_TGL;          /**< External Interrupt Port Select Low                 */
  __IOM uint32_t             EXTIPSELH_TGL;          /**< External interrupt Port Select High                */
  __IOM uint32_t             EXTIPINSELL_TGL;        /**< External Interrupt Pin Select Low                  */
  __IOM uint32_t             EXTIPINSELH_TGL;        /**< External Interrupt Pin Select High                 */
  __IOM uint32_t             EXTIRISE_TGL;           /**< External Interrupt Rising Edge Trigger             */
  __IOM uint32_t             EXTIFALL_TGL;           /**< External Interrupt Falling Edge Trigger            */
        uint32_t             RESERVED50[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable                                   */
        uint32_t             RESERVED51[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM4WUEN_TGL;            /**< EM4 wakeup enable                                  */
  __IOM uint32_t             EM4WUPOL_TGL;           /**< EM4 wakeup polarity                                */
        uint32_t             RESERVED52[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             DBGROUTEPEN_TGL;        /**< Debugger Route Pin enable                          */
  __IOM uint32_t             TRACEROUTEPEN_TGL;      /**< Trace Route Pin Enable                             */
        uint32_t             RESERVED53[2U];         /**< Reserved for future use                            */
        uint32_t             RESERVED54[4U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDSEG_TGL;             /**< LCD Segment Enable                                 */
        uint32_t             RESERVED55[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCOM_TGL;             /**< LCD Common Enable                                  */
        uint32_t             RESERVED56[3U];         /**< Reserved for future use                            */
        GPIO_ACMPROUTE_TypeDef ACMPROUTE_TGL[2U];      /**< acmp0 DBUS config registers                        */
        GPIO_CMUROUTE_TypeDef CMUROUTE_TGL;           /**< cmu DBUS config registers                          */
        uint32_t             RESERVED57[4U];         /**< Reserved for future use                            */
        GPIO_EUSARTROUTE_TypeDef EUSARTROUTE_TGL[3U];    /**< eusart0 DBUS config registers                      */
        GPIO_FRCROUTE_TypeDef FRCROUTE_TGL;           /**< frc DBUS config registers                          */
        GPIO_I2CROUTE_TypeDef I2CROUTE_TGL[2U];       /**< i2c0 DBUS config registers                         */
        GPIO_KEYSCANROUTE_TypeDef KEYSCANROUTE_TGL;       /**< keyscan DBUS config registers                      */
        GPIO_LESENSEROUTE_TypeDef LESENSEROUTE_TGL;       /**< lesense DBUS config registers                      */
        GPIO_LETIMERROUTE_TypeDef LETIMERROUTE_TGL;       /**< letimer DBUS config registers                      */
        GPIO_MODEMROUTE_TypeDef MODEMROUTE_TGL;         /**< modem DBUS config registers                        */
        GPIO_PCNTROUTE_TypeDef PCNTROUTE_TGL[1U];      /**< pcnt0 DBUS config registers                        */
        GPIO_PRSROUTE_TypeDef PRSROUTE_TGL[1U];       /**< prs0 DBUS config registers                         */
        uint32_t             RESERVED58[23U];        /**< Reserved for future use                            */
        GPIO_SYXOROUTE_TypeDef SYXOROUTE_TGL[1U];      /**< syxo0 DBUS config registers                        */
        GPIO_TIMERROUTE_TypeDef TIMERROUTE_TGL[5U];     /**< timer0 DBUS config registers                       */
        GPIO_USARTROUTE_TypeDef USARTROUTE_TGL[1U];     /**< usart0 DBUS config registers                       */
} GPIO_TypeDef;


/* Bit fields for GPIO IPVERSION */
#define _GPIO_IPVERSION_RESETVALUE              0x00000002UL                            /**< Default value for GPIO_IPVERSION            */
#define _GPIO_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Mask for GPIO_IPVERSION                     */
#define _GPIO_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for GPIO_IPVERSION              */
#define _GPIO_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                            /**< Bit mask for GPIO_IPVERSION                 */
#define _GPIO_IPVERSION_IPVERSION_DEFAULT       0x00000002UL                            /**< Mode DEFAULT for GPIO_IPVERSION             */
#define GPIO_IPVERSION_IPVERSION_DEFAULT        (_GPIO_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_IPVERSION     */
#define GPIO_PORTA                              0x00000000UL                            /**< PORTA index                                  */
#define GPIO_PORTB                              0x00000001UL                            /**< PORTB index                                  */
#define GPIO_PORTC                              0x00000002UL                            /**< PORTC index                                  */
#define GPIO_PORTD                              0x00000003UL                            /**< PORTD index                                  */

